// Задача 59: Задайте двумерный массив из целых чисел. 
// Напишите программу, которая удалит строку и столбец, на пересечении которых расположен наименьший элемент массива.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 5 2 6 7
// Наименьший элемент - 1, на выходе получим
// следующий массив:
// 9 4 2
// 2 2 6
// 3 4 7
Console.Clear();

int m = new Random().Next(1, 4);
int n = new Random().Next(1, 4);
int[,] num = new int[m, n];
int min = num[0, 0];
int [] num1 = new int[2];
for (int i = 0; i < num.GetLength(0); i++)
{
    for (int j = 0; j < num.GetLength(1); j++)
    {
        num[i, j] = new Random().Next(1, 10);
        Console.Write($"{num[i, j]} ");
        if(num[i, j] < min) min = num[i, j]; 
    }
    Console.WriteLine();
    
}
