// Задача фаталити. Надо подумать, как оптимизировать
// Необходимо найти 5 целых чисел (положительных), которые будут удовлетворять 
// такому условию x^5 + y^5 + z^5 + q^5 = w^5 Т.е. сумма 4 чисел в пятой степени = 5 числу
Console.WriteLine("Hello, World!");
